## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,406 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.firewall.azurerm_firewall.firewall[0] will be created
+  + resource "azurerm_firewall" "firewall" {
+      + dns_proxy_enabled   = (known after apply)
+      + firewall_policy_id  = (known after apply)
+      + id                  = (known after apply)
+      + location            = "eastus"
+      + name                = "firewall-app-test-eus"
+      + resource_group_name = "rg-app-test"
+      + sku_name            = "AZFW_VNet"
+      + sku_tier            = "Standard"
+      + tags                = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-firewall"
+        }
+      + threat_intel_mode   = "Alert"
+
+      + ip_configuration {
+          + name                 = "ipconfig-app-test-eus-vnet"
+          + private_ip_address   = (known after apply)
+          + public_ip_address_id = (known after apply)
+          + subnet_id            = (known after apply)
+        }
+      + ip_configuration {
+          + name                 = "ipconfig-app-test-eus-app"
+          + private_ip_address   = (known after apply)
+          + public_ip_address_id = (known after apply)
+        }
+    }
+
+  # module.firewall.azurerm_firewall_policy.policy[0] will be created
+  + resource "azurerm_firewall_policy" "policy" {
+      + child_policies           = (known after apply)
+      + firewalls                = (known after apply)
+      + id                       = (known after apply)
+      + location                 = "eastus"
+      + name                     = "firewall-policy-app-test-eus"
+      + resource_group_name      = "rg-app-test"
+      + rule_collection_groups   = (known after apply)
+      + sku                      = "Standard"
+      + threat_intelligence_mode = "Alert"
+    }
+
+  # module.firewall.azurerm_firewall_policy_rule_collection_group.app_policy[0] will be created
+  + resource "azurerm_firewall_policy_rule_collection_group" "app_policy" {
+      + firewall_policy_id = (known after apply)
+      + id                 = (known after apply)
+      + name               = "DefaultApplicationRuleCollectionGroup"
+      + priority           = 300
+
+      + application_rule_collection {
+          + action   = "Allow"
+          + name     = "example_app_policy"
+          + priority = 200
+
+          + rule {
+              + destination_fqdns = [
+                  + "*",
+                ]
+              + name              = "app_test"
+              + source_addresses  = [
+                  + "*",
+                ]
+              + source_ip_groups  = []
+
+              + protocols {
+                  + port = 443
+                  + type = "Https"
+                }
+              + protocols {
+                  + port = 80
+                  + type = "Http"
+                }
+            }
+        }
+    }
+
+  # module.firewall.azurerm_firewall_policy_rule_collection_group.nat_policy[0] will be created
+  + resource "azurerm_firewall_policy_rule_collection_group" "nat_policy" {
+      + firewall_policy_id = (known after apply)
+      + id                 = (known after apply)
+      + name               = "DefaultDnatRuleCollectionGroup"
+      + priority           = 100
+
+      + nat_rule_collection {
+          + action   = "Dnat"
+          + name     = "web_server_nat_policy"
+          + priority = 100
+
+          + rule {
+              + destination_address = (known after apply)
+              + destination_ports   = [
+                  + "8080",
+                ]
+              + name                = "web_server_nat"
+              + protocols           = [
+                  + "TCP",
+                ]
+              + source_addresses    = [
+                  + "*",
+                ]
+              + translated_address  = "10.0.1.20"
+              + translated_port     = 80
+            }
+        }
+    }
+
+  # module.firewall.azurerm_firewall_policy_rule_collection_group.network_policy[0] will be created
+  + resource "azurerm_firewall_policy_rule_collection_group" "network_policy" {
+      + firewall_policy_id = (known after apply)
+      + id                 = (known after apply)
+      + name               = "DefaultNetworkRuleCollectionGroup"
+      + priority           = 200
+
+      + network_rule_collection {
+          + action   = "Allow"
+          + name     = "example_network_policy"
+          + priority = 100
+
+          + rule {
+              + destination_addresses = [
+                  + "*",
+                ]
+              + destination_fqdns     = []
+              + destination_ip_groups = []
+              + destination_ports     = [
+                  + "22",
+                ]
+              + name                  = "ssh"
+              + protocols             = [
+                  + "TCP",
+                ]
+              + source_addresses      = [
+                  + "*",
+                ]
+              + source_ip_groups      = []
+            }
+        }
+      + network_rule_collection {
+          + action   = "Allow"
+          + name     = "example_network_policy-2"
+          + priority = 101
+
+          + rule {
+              + destination_addresses = [
+                  + "*",
+                ]
+              + destination_fqdns     = []
+              + destination_ip_groups = []
+              + destination_ports     = [
+                  + "587",
+                ]
+              + name                  = "smtp"
+              + protocols             = [
+                  + "TCP",
+                ]
+              + source_addresses      = [
+                  + "*",
+                ]
+              + source_ip_groups      = []
+            }
+        }
+    }
+
+  # module.firewall.azurerm_monitor_diagnostic_setting.firewall_diagnostic[0] will be created
+  + resource "azurerm_monitor_diagnostic_setting" "firewall_diagnostic" {
+      + id                             = (known after apply)
+      + log_analytics_destination_type = "AzureDiagnostics"
+      + log_analytics_workspace_id     = (known after apply)
+      + name                           = "firewall-diagnostic-app-test-eus"
+      + target_resource_id             = (known after apply)
+
+      + enabled_log {
+          + category       = "AzureFirewallApplicationRule"
+            # (1 unchanged attribute hidden)
+        }
+      + enabled_log {
+          + category       = "AzureFirewallDnsProxy"
+            # (1 unchanged attribute hidden)
+        }
+      + enabled_log {
+          + category       = "AzureFirewallNetworkRule"
+            # (1 unchanged attribute hidden)
+        }
+
+      + enabled_metric (known after apply)
+
+      + metric (known after apply)
+    }
+
+  # module.firewall.azurerm_public_ip.public_ip["app"] will be created
+  + resource "azurerm_public_ip" "public_ip" {
+      + allocation_method       = "Static"
+      + ddos_protection_mode    = "VirtualNetworkInherited"
+      + fqdn                    = (known after apply)
+      + id                      = (known after apply)
+      + idle_timeout_in_minutes = 4
+      + ip_address              = (known after apply)
+      + ip_version              = "IPv4"
+      + location                = "eastus"
+      + name                    = "pip-app-test-eus-app"
+      + public_ip_prefix_id     = (known after apply)
+      + resource_group_name     = "rg-app-test"
+      + sku                     = "Standard"
+      + sku_tier                = "Regional"
+      + tags                    = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-firewall"
+        }
+    }
+
+  # module.firewall.azurerm_public_ip.public_ip["vnet"] will be created
+  + resource "azurerm_public_ip" "public_ip" {
+      + allocation_method       = "Static"
+      + ddos_protection_mode    = "VirtualNetworkInherited"
+      + fqdn                    = (known after apply)
+      + id                      = (known after apply)
+      + idle_timeout_in_minutes = 4
+      + ip_address              = (known after apply)
+      + ip_version              = "IPv4"
+      + location                = "eastus"
+      + name                    = "pip-app-test-eus-vnet"
+      + public_ip_prefix_id     = (known after apply)
+      + resource_group_name     = "rg-app-test"
+      + sku                     = "Standard"
+      + sku_tier                = "Regional"
+      + tags                    = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-firewall"
+        }
+    }
+
+  # module.firewall.azurerm_public_ip_prefix.pip_prefix[0] will be created
+  + resource "azurerm_public_ip_prefix" "pip_prefix" {
+      + id                  = (known after apply)
+      + ip_prefix           = (known after apply)
+      + ip_version          =
```
See the full diff from https://github.com/terraform-az-modules/terraform-azurerm-firewall/actions/runs/19373037580

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azurerm-firewall/actions/runs/19373037580)

<!-- diff-action -->
<!-- diff-action/Terraform Plan Difference/terraform-plan-diff -->